# Introduction to Pandas

**Reference :** NCERT Informatics Practices Textbook for Std XII Chapters 2,3

PANDAS (PANel DAta) is a high-level data manipulation 
tool used for analysing data. It is very easy to import 
and export data using Pandas library which has a very 
rich set of functions. It is built on packages like NumPy 
and Matplotlib and gives us a single, convenient place 
to do most of our data analysis and visualisation work. 
Pandas has two important data structures, namely â€“ 
Series and DataFrame to make the process of 
analysing data organised, effective and efficient.

In [ ]:
import pandas as pd

## Series

A Series is a one-dimensional array containing a 
sequence of values of any data type (int, float, list, 
string, etc) which by default have numeric data labels 
starting from zero. The data label associated with a 
particular value is called its index. We can also assign 
values of other data types as index. We can imagine a 
Pandas Series as a column in a spreadsheet.

### Creating a Series

In [ ]:
10,20,30->int64
10.0,20,30->float
'a',10,20->str->object
arrayName.astype(float/str/int64)
43.5->43

In [ ]:
series1 = pd.Series([10,20,30]) #create a Series
print(series1) #Display the series

0    10
1    20
2    30
dtype: int64

In [ ]:
series2 = pd.Series(["Kavi","Shyam","Ravi"], index=[3,5,1])
print(series2) #Display the series

3     Kavi
5    Shyam
1     Ravi
dtype: object

In [ ]:
series2 = pd.Series([2,3,4],index=["Feb","Mar","Apr"])
print(series2) #Display the series

Feb    2
Mar    3
Apr    4
May    a
dtype: object

In [ ]:
import numpy as np
array1 = np.array([1,2,3,4])
series3 = pd.Series(array1)
print(series3)

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
series4 = pd.Series(array1, index = ["Jan", "Feb", "Mar", "Apr"])
print(series4)

Jan    1
Feb    2
Mar    3
Apr    4
dtype: int64

In [ ]:
dict1 = {'India': 'NewDelhi', 'UK': 'London', 'Japan': 'Tokyo'}
print(dict1) #Display the dictionary

{'India': 'NewDelhi', 'UK': 'London', 'Japan': 'Tokyo'}

In [ ]:
series8 = pd.Series(dict1) 
print(series8)

India    NewDelhi
UK         London
Japan       Tokyo
dtype: object

### Accessing Elements of a Series

#### Indexing & Slicing

In [ ]:
print(series4)

Jan    1
Feb    2
Mar    3
Apr    4
dtype: int64

In [ ]:
series4['Jan']

1

In [ ]:
series4[1]

2

In [ ]:
series4.loc['Feb']

2

In [ ]:
series4.iloc[1]

2

In [ ]:
series4.loc[['Feb','Apr']]

Feb    2
Apr    4
dtype: int64

In [ ]:
series4.iloc[[1,3]]

Feb    2
Apr    4
dtype: int64

In [ ]:
series4.iloc[1:3]#similar to python list, element 3 is not printed

Feb    2
Mar    3
dtype: int64

In [ ]:
series4.iloc[1::2]

Feb    2
Apr    4
dtype: int64

In [ ]:
series4.iloc[1:3:2]

Feb    2
dtype: int64

In [ ]:
series4.loc['Feb':'Apr']#label based all labels asked for are printed

Feb    2
Mar    3
Apr    4
dtype: int64

### Atributes of Series

* name
* index.name
* values
* size
* empty

In [ ]:
series4.name="Test"

In [ ]:
print(series4.name)

Test

In [ ]:
print(series4)

Jan    1
Feb    2
Mar    3
Apr    4
Name: Test, dtype: int64

In [ ]:
series4.index.name="Months"
print(series4)

Months
Jan    1
Feb    2
Mar    3
Apr    4
Name: Test, dtype: int64

In [ ]:
series4.values

array([1, 2, 3, 4])

In [ ]:
series4.size#NaN is also counted

4

In [ ]:
series4.empty

False

### Methods of Series

* head
* count
* tail

In [ ]:
series4.head(2)

Months
Jan    1
Feb    2
Name: Test, dtype: int64

In [ ]:
series4.tail(3)

Months
Feb    2
Mar    3
Apr    4
Name: Test, dtype: int64

In [ ]:
series4.count()#NaN is not counted

4

## Dataframe

A DataFrame is a two-dimensional labelled data structure. It contains rows and columns, and therefore 
has both a row and column index. Each column can 
have a different type of value such as numeric, string, 
boolean, etc., as in tables of a database

### Creating a Dataframe

In [ ]:
dFrameEmt = pd.DataFrame()
print(dFrameEmt)

Empty DataFrame
Columns: []
Index: []

In [ ]:
array1 = np.array([10,20,30])
array2 = np.array([100,200,300])
array3 = np.array([-10,-20,-30, -40])

In [ ]:
dFrame2 = pd.DataFrame(array1)#axis=0->row, axis=1->column
dFrame2

    0
0  10
1  20
2  30

In [ ]:
dFrame5 = pd.DataFrame([array1, array3, array2], columns=[ 'A', 'B', 'C', 'D'])
dFrame5

     A    B    C     D
0   10   20   30   NaN
1  -10  -20  -30 -40.0
2  100  200  300   NaN

In [ ]:
# Create list of dictionaries
listDict = [{'a':10, 'b':20}, {'a':5, 'b':10, 'c':20}]

In [ ]:
dFrameListDict = pd.DataFrame(listDict)
dFrameListDict

    a   b     c
0  10  20   NaN
1   5  10  20.0

In [ ]:
# Create dictionary of lists
listDict = {'a':[10,5], 'b':[20,10], 'c':[np.NaN,20]}

In [ ]:
dFrameListDict = pd.DataFrame(listDict)
dFrameListDict

    a   b     c
0  10  20   NaN
1   5  10  20.0

In [ ]:
dictForest = {'State': ['Assam', 'Delhi', 'Kerala'], 'GArea': [78438, 1483, 38852] , 'VDF' : [2797, 6.72,1663]}
dFrameForest= pd.DataFrame(dictForest)
dFrameForest

    State  GArea      VDF
0   Assam  78438  2797.00
1   Delhi   1483     6.72
2  Kerala  38852  1663.00

In [ ]:
dFrameForest1 = pd.DataFrame(dictForest, columns = ['State','VDF', 'GArea'])
dFrameForest1

    State      VDF  GArea
0   Assam  2797.00  78438
1   Delhi     6.72   1483
2  Kerala  1663.00  38852

In [ ]:
seriesA = pd.Series([1,2,3,4,5], index = ['a', 'b', 'c', 'd', 'e'])
seriesB = pd.Series ([1000,2000,-1000,-5000,1000], index = ['a', 'b', 'c', 'd', 'e'])
seriesC = pd.Series([10,20,-10,-50,100], index = ['z', 'y', 'a', 'c', 'e'])

In [ ]:
dFrame7 = pd.DataFrame([seriesA, seriesB])
dFrame7

      a     b     c     d     e
0     1     2     3     4     5
1  1000  2000 -1000 -5000  1000

In [ ]:
dFrame8 = pd.DataFrame([seriesA, seriesC])
dFrame8

      a    b     c    d      e     z     y
0   1.0  2.0   3.0  4.0    5.0   NaN   NaN
1 -10.0  NaN -50.0  NaN  100.0  10.0  20.0

In [ ]:
dFrame8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      float64
 1   b       1 non-null      float64
 2   c       2 non-null      float64
 3   d       1 non-null      float64
 4   e       2 non-null      float64
 5   z       1 non-null      float64
 6   y       1 non-null      float64
dtypes: float64(7)
memory usage: 240.0 bytes

In [ ]:
ResultSheet={
'Arnab': pd.Series([90, 91, 97], index=['Maths','Science','Hindi']),
'Ramit': pd.Series([92, 81, 96], index=['Maths','Science','Hindi']),
'Samridhi': pd.Series([89, 91, 88], index=['Maths','Science','Hindi']),
'Riya': pd.Series([81, 71, 67], index=['Maths','Science','Hindi']),
'Mallika': pd.Series([94, 95, 99], index=['Maths','Science','Hindi'])}

In [ ]:
ResultDF = pd.DataFrame(ResultSheet)
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [ ]:
ResultDF.T#Transpose

          Maths  Science  Hindi
Arnab        90       91     97
Ramit        92       81     96
Samridhi     89       91     88
Riya         81       71     67
Mallika      94       95     99

In [ ]:
ResultDF.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Maths to Hindi
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Arnab     3 non-null      int64
 1   Ramit     3 non-null      int64
 2   Samridhi  3 non-null      int64
 3   Riya      3 non-null      int64
 4   Mallika   3 non-null      int64
dtypes: int64(5)
memory usage: 224.0+ bytes

In [ ]:
df = pd.read_csv("sample_data/california_housing_test.csv")
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           3000 non-null   float64
 1   latitude            3000 non-null   float64
 2   housing_median_age  3000 non-null   float64
 3   total_rooms         3000 non-null   float64
 4   total_bedrooms      3000 non-null   float64
 5   population          3000 non-null   float64
 6   households          3000 non-null   float64
 7   median_income       3000 non-null   float64
 8   median_house_value  3000 non-null   float64
dtypes: float64(9)
memory usage: 211.1 KB

In [ ]:
df.describe()

         longitude    latitude  ...  median_income  median_house_value
count  3000.000000  3000.00000  ...    3000.000000          3000.00000
mean   -119.589200    35.63539  ...       3.807272        205846.27500
std       1.994936     2.12967  ...       1.854512        113119.68747
min    -124.180000    32.56000  ...       0.499900         22500.00000
25%    -121.810000    33.93000  ...       2.544000        121200.00000
50%    -118.485000    34.27000  ...       3.487150        177650.00000
75%    -118.020000    37.69000  ...       4.656475        263975.00000
max    -114.490000    41.92000  ...      15.000100        500001.00000

[8 rows x 9 columns]

In [ ]:
df.describe(include='all')

         longitude    latitude  ...  median_income  median_house_value
count  3000.000000  3000.00000  ...    3000.000000          3000.00000
mean   -119.589200    35.63539  ...       3.807272        205846.27500
std       1.994936     2.12967  ...       1.854512        113119.68747
min    -124.180000    32.56000  ...       0.499900         22500.00000
25%    -121.810000    33.93000  ...       2.544000        121200.00000
50%    -118.485000    34.27000  ...       3.487150        177650.00000
75%    -118.020000    37.69000  ...       4.656475        263975.00000
max    -114.490000    41.92000  ...      15.000100        500001.00000

[8 rows x 9 columns]

In [ ]:
df = pd.read_csv("sample_data/mnist_test.csv",header=None)
df.head()

   0    1    2    3    4    5    6    ...  778  779  780  781  782  783  784
0    7    0    0    0    0    0    0  ...    0    0    0    0    0    0    0
1    2    0    0    0    0    0    0  ...    0    0    0    0    0    0    0
2    1    0    0    0    0    0    0  ...    0    0    0    0    0    0    0
3    0    0    0    0    0    0    0  ...    0    0    0    0    0    0    0
4    4    0    0    0    0    0    0  ...    0    0    0    0    0    0    0

[5 rows x 785 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Columns: 785 entries, 0 to 784
dtypes: int64(785)
memory usage: 59.9 MB

### Operations on rows and columns in DataFrames

In [ ]:
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [ ]:
ResultDF['Preeti']=[89,78,76]
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     92        89    81       94      89
Science     91     81        91    71       95      78
Hindi       97     96        88    67       99      76

In [ ]:
ResultDF['Ramit']=[99, 98, 78]
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     99        89    81       94      89
Science     91     98        91    71       95      78
Hindi       97     78        88    67       99      76

In [ ]:
ResultDF.Ramit=[99, 89, 78,76]
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths        0     99         0     0        0       0
Science     90     89        91    71       95      78
Hindi       90     78        88    67       99      76
English     95     76        95    80       95      99

In [ ]:
ResultDF['Arnab']=90
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     99        89    81       94      89
Science     90     98        91    71       95      78
Hindi       90     78        88    67       99      76

In [ ]:
ResultDF.loc['English'] = [85, 86, 83, 80, 90, 89]
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     99        89    81       94      89
Science     90     98        91    71       95      78
Hindi       90     78        88    67       99      76
English     85     86        83    80       90      89

In [ ]:
ResultDF.loc['English'] = [95, 86, 95, 80, 95,99]
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     99        89    81       94      89
Science     90     98        91    71       95      78
Hindi       90     78        88    67       99      76
English     95     86        95    80       95      99

In [ ]:
ResultDF.loc['Maths']=0
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths        0      0         0     0        0       0
Science     90     98        91    71       95      78
Hindi       90     78        88    67       99      76
English     95     86        95    80       95      99

In [ ]:
ResultDF.loc[:,'Mallika']=0
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths        0     99         0     0        0       0
Science     90     89        91    71        0      78
Hindi       90     78        88    67        0      76
English     95     76        95    80        0      99

In [ ]:
ResultDF.loc[:,['Arnab','Mallika']]=10
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       10     99         0     0       10       0
Science     10     89        91    71       10      78
Hindi       10     78        88    67       10      76
English     10     76        95    80       10      99

In [ ]:
ResultDF.iloc[2]=0
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       10     99         0     0       10       0
Science     10     89        91    71       10      78
Hindi        0      0         0     0        0       0
English     10     76        95    80       10      99

In [ ]:
ResultDF.iloc[:,2]=0
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       10     99         0     0       10       0
Science     10     89         0    71       10      78
Hindi        0      0         0     0        0       0
English     10     76         0    80       10      99

In [ ]:
ResultDF = ResultDF.drop('Science', axis=0)
ResultDF

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       10     99         0     0       10       0
Hindi        0      0         0     0        0       0
English     10     76         0    80       10      99

In [ ]:
ResultDF = ResultDF.drop(['Samridhi','Ramit','Riya'], axis=1)
ResultDF

         Arnab  Mallika  Preeti
Maths       10       10       0
Hindi        0        0       0
English     10       10      99

### Accessing DataFrames Element through Slicing

In [ ]:
ResultDF.loc['Maths': 'Science']

Empty DataFrame
Columns: [Arnab, Mallika, Preeti]
Index: []

In [ ]:
ResultDF.loc['Maths': 'Science', 'Arnab':'Samridhi']

Empty DataFrame
Columns: [Arnab, Mallika, Preeti]
Index: []

In [ ]:
iloc

In [ ]:
iloc

### Joining, Merging and Concatenation of  DataFrames

In [ ]:
dFrame1=pd.DataFrame([[1, 2, 3], [4, 5], [6]], columns=['C1', 'C2', 'C3'], index=['R1','R2', 'R3'])
dFrame1

    C1   C2   C3
R1   1  2.0  3.0
R2   4  5.0  NaN
R3   6  NaN  NaN

In [ ]:
dFrame2=pd.DataFrame([[10, 20], [30], [40, 50]], columns=['C2', 'C5'], index=['R4', 'R2', 'R5'])
dFrame2

    C2    C5
R4  10  20.0
R2  30   NaN
R5  40  50.0

In [ ]:
dFrame1.append(dFrame2)

     C1    C2   C3    C5
R1  1.0   2.0  3.0   NaN
R2  4.0   5.0  NaN   NaN
R3  6.0   NaN  NaN   NaN
R4  NaN  10.0  NaN  20.0
R2  NaN  30.0  NaN   NaN
R5  NaN  40.0  NaN  50.0

In [ ]:
dFrame1=pd.DataFrame([[1, 2, 3], [4, 5], [6]], columns=['C1', 'C2', 'C3'], index=['R1','R2', 'R3'])
dFrame1

    C1   C2   C3
R1   1  2.0  3.0
R2   4  5.0  NaN
R3   6  NaN  NaN

In [ ]:
dFrame2.append(dFrame1)

      C2    C5   C1   C3
R4  10.0  20.0  NaN  NaN
R2  30.0   NaN  NaN  NaN
R5  40.0  50.0  NaN  NaN
R1   2.0   NaN  1.0  3.0
R2   5.0   NaN  4.0  NaN
R3   NaN   NaN  6.0  NaN

In [ ]:
dFrame2.append(dFrame1, sort= True)

     C1    C2   C3    C5
R4  NaN  10.0  NaN  20.0
R2  NaN  30.0  NaN   NaN
R5  NaN  40.0  NaN  50.0
R1  1.0   2.0  3.0   NaN
R2  4.0   5.0  NaN   NaN
R3  6.0   NaN  NaN   NaN

In [ ]:
dFrame1.append(dFrame2, ignore_index=True)

    C1    C2   C3    C5
0  1.0   2.0  3.0   NaN
1  4.0   5.0  NaN   NaN
2  6.0   NaN  NaN   NaN
3  NaN  10.0  NaN  20.0
4  NaN  30.0  NaN   NaN
5  NaN  40.0  NaN  50.0

Reference : https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [ ]:
concat

In [ ]:
merge

### Attributes & Methods of DataFrames

* index
* columns
* dtypes
* values
* shape
* size
* T
* head()
* tail()
* empty
* describe
* info

### Data Aggregations

In [ ]:
marksUT= {'Name':['Raman','Raman','Raman','Zuhaire','Zuhaire','Zuhaire', 'Ashravy','Ashravy','Ashravy','Mishti','Mishti','Mishti'],
 'UT':[1,2,3,1,2,3,1,2,3,1,2,3],
 'Maths':[22,21,14,20,23,22,23,24,12,15,18,17],
 'Science':[21,20,19,17,15,18,19,22,25,22,21,18],
 'S.St':[18,17,15,22,21,19,20,24,19,25,25,20],
 'Hindi':[20,22,24,24,25,23,15,17,21,22,24,25],
 'Eng':[21,24,23,19,15,13,22,21,23,22,23,20]
 }
df=pd.DataFrame(marksUT)
print(df)

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20

In [ ]:
df.sort_values(by=['UT'],inplace=True)

In [ ]:
df

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
3   Zuhaire   1     20       17    22     24   19
6   Ashravy   1     23       19    20     15   22
9    Mishti   1     15       22    25     22   22
1     Raman   2     21       20    17     22   24
4   Zuhaire   2     23       15    21     25   15
7   Ashravy   2     24       22    24     17   21
10   Mishti   2     18       21    25     24   23
2     Raman   3     14       19    15     24   23
5   Zuhaire   3     22       18    19     23   13
8   Ashravy   3     12       25    19     21   23
11   Mishti   3     17       18    20     25   20

In [ ]:
df.aggregate('max')

Name       Zuhaire
UT               3
Maths           24
Science         25
S.St            25
Hindi           25
Eng             24
dtype: object

In [ ]:
df.drop(['Name','UT'],axis=1,inplace=True)

In [ ]:
df.aggregate('max',axis=1)

0     22
1     24
2     24
3     24
4     25
5     23
6     23
7     24
8     25
9     25
10    25
11    25
dtype: int64

In [ ]:
 df.aggregate(['max','mean'])

         Name   UT  Maths  Science       S.St      Hindi   Eng
max   Zuhaire  3.0  24.00    25.00  25.000000  25.000000  24.0
mean      NaN  2.0  19.25    19.75  20.416667  21.833333  20.5

In [ ]:
 df[['Maths','Science']].aggregate(['max','mean'],axis=1)

     max  mean
0   22.0  21.5
1   21.0  20.5
2   19.0  16.5
3   20.0  18.5
4   23.0  19.0
5   22.0  20.0
6   23.0  21.0
7   24.0  23.0
8   25.0  18.5
9   22.0  18.5
10  21.0  19.5
11  18.0  17.5

### Indexing

In [ ]:
df.set_index(['Name','UT'], inplace=True)
df

            Maths  Science  S.St  Hindi  Eng
Name    UT
Raman   1      22       21    18     20   21
        2      21       20    17     22   24
        3      14       19    15     24   23
Zuhaire 1      20       17    22     24   19
        2      23       15    21     25   15
        3      22       18    19     23   13
Ashravy 1      23       19    20     15   22
        2      24       22    24     17   21
        3      12       25    19     21   23
Mishti  1      15       22    25     22   22
        2      18       21    25     24   23
        3      17       18    20     25   20

In [ ]:
df.reset_index(inplace=True)
df

    UT     Name  Maths  Science  S.St  Hindi  Eng
0    1  Ashravy     23       19    20     15   22
1    1   Mishti     15       22    25     22   22
2    1    Raman     22       21    18     20   21
3    1  Zuhaire     20       17    22     24   19
4    2  Ashravy     24       22    24     17   21
5    2   Mishti     18       21    25     24   23
6    2    Raman     21       20    17     22   24
7    2  Zuhaire     23       15    21     25   15
8    3  Ashravy     12       25    19     21   23
9    3   Mishti     17       18    20     25   20
10   3    Raman     14       19    15     24   23
11   3  Zuhaire     22       18    19     23   13

In [ ]:
df.set_index(['UT','Name'], inplace=True)
df

            Maths  Science  S.St  Hindi  Eng
UT Name
1  Raman       22       21    18     20   21
2  Raman       21       20    17     22   24
3  Raman       14       19    15     24   23
1  Zuhaire     20       17    22     24   19
2  Zuhaire     23       15    21     25   15
3  Zuhaire     22       18    19     23   13
1  Ashravy     23       19    20     15   22
2  Ashravy     24       22    24     17   21
3  Ashravy     12       25    19     21   23
1  Mishti      15       22    25     22   22
2  Mishti      18       21    25     24   23
3  Mishti      17       18    20     25   20

In [ ]:
df.reset_index(inplace=True)
df

    UT     Name  Maths  Science  S.St  Hindi  Eng
0    1    Raman     22       21    18     20   21
1    2    Raman     21       20    17     22   24
2    3    Raman     14       19    15     24   23
3    1  Zuhaire     20       17    22     24   19
4    2  Zuhaire     23       15    21     25   15
5    3  Zuhaire     22       18    19     23   13
6    1  Ashravy     23       19    20     15   22
7    2  Ashravy     24       22    24     17   21
8    3  Ashravy     12       25    19     21   23
9    1   Mishti     15       22    25     22   22
10   2   Mishti     18       21    25     24   23
11   3   Mishti     17       18    20     25   20

### Sorting a dataframe

In [ ]:
df.sort_values(by=['UT'],inplace=True)
df

    UT     Name  Maths  Science  S.St  Hindi  Eng
0    1    Raman     22       21    18     20   21
3    1  Zuhaire     20       17    22     24   19
6    1  Ashravy     23       19    20     15   22
9    1   Mishti     15       22    25     22   22
1    2    Raman     21       20    17     22   24
4    2  Zuhaire     23       15    21     25   15
7    2  Ashravy     24       22    24     17   21
10   2   Mishti     18       21    25     24   23
2    3    Raman     14       19    15     24   23
5    3  Zuhaire     22       18    19     23   13
8    3  Ashravy     12       25    19     21   23
11   3   Mishti     17       18    20     25   20

In [ ]:
df.set_index(['UT','Name'], inplace=True)
df

            Maths  Science  S.St  Hindi  Eng
UT Name
1  Raman       22       21    18     20   21
   Zuhaire     20       17    22     24   19
   Ashravy     23       19    20     15   22
   Mishti      15       22    25     22   22
2  Raman       21       20    17     22   24
   Zuhaire     23       15    21     25   15
   Ashravy     24       22    24     17   21
   Mishti      18       21    25     24   23
3  Raman       14       19    15     24   23
   Zuhaire     22       18    19     23   13
   Ashravy     12       25    19     21   23
   Mishti      17       18    20     25   20

In [ ]:
df.sort_index(inplace=True)
df

            Maths  Science  S.St  Hindi  Eng
Name    UT
Ashravy 1      23       19    20     15   22
        2      24       22    24     17   21
        3      12       25    19     21   23
Mishti  1      15       22    25     22   22
        2      18       21    25     24   23
        3      17       18    20     25   20
Raman   1      22       21    18     20   21
        2      21       20    17     22   24
        3      14       19    15     24   23
Zuhaire 1      20       17    22     24   19
        2      23       15    21     25   15
        3      22       18    19     23   13

In [ ]:
df.sort_index(axis=1, inplace=True)
df

            Eng  Hindi  Maths  S.St  Science
Name    UT
Ashravy 1    22     15     23    20       19
        2    21     17     24    24       22
        3    23     21     12    19       25
Mishti  1    22     22     15    25       22
        2    23     24     18    25       21
        3    20     25     17    20       18
Raman   1    21     20     22    18       21
        2    24     22     21    17       20
        3    23     24     14    15       19
Zuhaire 1    19     24     20    22       17
        2    15     25     23    21       15
        3    13     23     22    19       18

### Group by functions

Reference : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html

### Pivot Tables

Reference : https://pandas.pydata.org/docs/reference/api/pandas.pivot_table.html

# Thank You

Arun P R